//
//  Data.swift
//  123
//
//  Created by User10 on 2019/10/2.
//  Copyright © 2019 Starmy. All rights reserved.
//

import Foundation

let Preliminarysongs = [Song(name: "三浦台", singer: "114：51", lyrics: "第28集：高校聯赛預賽開始\n三浦台也算是曾經的強者了，上一次的選拔大賽中，它們敗給了海南而失去了資格，所以一年來它們的訓練主要是針對海南而進行的。\n這場比賽一開始就有些戲劇性，櫻木花道、流川楓、三井壽、宮城良田因為打架事件而被安西教練懲罰不准上場，所以前半場赤木帶領副隊長木暮公延等人上場了，因為實力懸殊而且僅靠赤木一人不可能反攻，因此打的比較辛苦，差距也拉開了。\n湘北與三浦台的差距拉大點燃了湘北問題兒童們的怒火，得到安西教練的指示上場後，湘北最強五人組到齊，反攻開始。三浦台基本沒有什麼還手之力，除了赤木和流川楓，更有控球後衛宮城重登球場，國中最優秀選手三井壽歸來，櫻木花道現在還是個門外漢。三浦台的教練只好出動秘密武器內藤，而且也找到了湘北的防守弱點，也就是籃球新手櫻木。這場比賽依然是流川楓的秀場，他發現了內藤的弱點並揭示出來，自此三浦台大勢已去。最後以櫻木花道的灌籃失誤結束。\n"),
             Song(name: "角野高中", singer: "160：24", lyrics: "第33集：退場王！？樱木花道"),
             Song(name: "高田", singer: "103：59", lyrics: "第35集：男兒的熾熱夢想"),
             Song(name: "津久武", singer: "111：79", lyrics: "第36集:種子學校，翔陽出場"),
             Song(name: "翔陽", singer: "62：60", lyrics: "第36集:種子學校，翔陽出場\n翔陽是在上一次的大賽中僅次于海南的球隊，隊長藤真健司曾帶領球隊兩次打進全國大賽，與海南的「怪物」隊長牧紳一併稱「神奈川雙雄」。他是球隊的教練兼球員，更是球隊的靈魂人物，只要有他在球隊的凝聚力和意志就一直在。這場比賽的兩點有兩個：一個是櫻木花道的籃板球才華終於表現出來了；另一個是三井的被對手言語刺激後的超常發揮。這場比賽開始前，並沒有多少人看好湘北，反而認為湘北運氣很背，碰上這樣一支球隊！開場的湘北的確是不敵翔陽，比分馬上被拉開了。翔陽的藤真還沒有上場，花形帶領著球隊就已經領先很多了。當然，湘北也不是任由欺負的，流川楓奮起反擊，三井超常發揮。最終，藤真被逼上場，雖然對戰況有所影響，但櫻木五次犯規離場前的那次灌籃，已經對局勢產生了不可改變的影響。\n")
             ]

let Finalsongs = [Song(name: "海南", singer: "88：90", lyrics:"第50集：向王者挑戰\n海南無疑是一位強大的對手，這場比賽是湘北唯一輸掉的比賽，海南的阿牧不愧是幾度阻止了藤真的「怪物」，一上場可以看出阿牧的實力真的不是蓋的。這一戰可以說湘北的各位都已經盡力了，櫻木花道為了爭球不怕受傷撲到教練席，流川楓更是累到體力不支，赤木更是在體力超負荷的情況下戰鬥而且扭傷了腳。失敗的原因還是因為修煉不夠，球隊球員之間的默契不夠，還有海南太強了。看著櫻木花道不甘心的留下了熾熱的眼淚，瞬間點燃了自己。"),
                  Song(name: "武里", singer: "120：81", lyrics: "第62集:特訓3Days"),
                  Song(name: "陵南", singer: "70：66", lyrics: "第67集:最终決戰！湘北Vs陵南\n上場後湘北的第一個危機就是赤木，赤木擔心自己的腳傷會影響後面的比賽形勢和球隊的士氣，而不敢再隨心的打球，導致失誤連連，陵南步步緊逼。還好櫻木及時拉回赤木，避免了失分過多。而且下半場開始戰局真的是千變萬化，優劣態勢在雙方球隊之間來迴轉變。但是此時的湘北應經不是赤木一人的球隊了，中鋒赤木他的身高和技術足以守好籃下，小前鋒流川楓能夠不分位置全場輔助，控球後衛宮城良田不僅可以傳球也可以自己得分，得分後衛、三分球射手三井守在外圍，大前鋒櫻木花道這位籃板球小霸王使得籃下防守更加的堅固，想要擊敗湘北，實在是太難了！\n這場比賽可以說是櫻木花道的成長個人秀了，被魚柱控住球，被仙道無視，被福田挑釁，受傷的櫻木花道痛定思痛。回到球場後，利用起大猩猩交給他的技巧，結合他的籃板球才華驚呆了全場。攔福田，搶仙道球，蓋魚柱火鍋，櫻木花道出現在了所有他應該出現的地方，讓陵南的教練大驚失色，更是驚呆了藤真、阿牧等實力球員，毫無疑問櫻木花道的籃球運動細胞覺醒了。櫻木的最後一球，真的是記憶猶新啊，赤木的投籃被福田阻攔，但運動神經活躍、跳躍力超乎常人的櫻木再現籃板球小霸王的才能，接下籃板球，用盡全力完成了一次灌籃，定下了陵南的敗局。\n")
            ]

let Nationalsongs = [Song(name: "豐玉高校", singer: "91：87", lyrics: "豐玉高中的實力還算強勁，但是除了板倉以外，其它四人也都均為三年級。相田彥一的同學石川英郎是豐玉12人大名單當中的唯一的一年級新生。而三年級里除了南烈和岸本以外，其它兩名球員連名字都讓人記不住，可見其實力的普通。那麼在二年級的替補球員里，實力自然也就更差了。\n岸本和南烈等人畢業後，金平教練也要離開豐玉高中了。看來豐玉只給了金平一年的合約，還要求球隊闖入全國大賽八強。其實豐玉要不是有北野教練留下的跑轟底子，憑藉現有球員的實力而言跟本算不得A級球隊。不得不說豐玉辭退北野教練的做法令球隊成績適得其反。這樣一支大阪的老牌強隊看來和神奈川縣的翔陽一樣都逃不掉落寞的命運。"),
                     Song(name: "山王工業", singer: "79：78", lyrics: "山王工業：尺北榮治、河田雅史、深津一成、一之倉、松本\n湘北：櫻木花道+流川楓+赤木剛憲+宮城良田+三井壽")
            
            ]
