//
//  MemberData.swift
//  123
//
//  Created by Dunja on 2019/10/13.
//  Copyright © 2019 Starmy. All rights reserved.
//

import Foundation

let members = [
    Member(Name: "櫻木花道", Birthday: "生日：04/01", Number: "球衣號碼：10號", Location: "位置：大前鋒", Height_Weight: "身高/體重：189.2cm / 83kg", Nickname: "綽號：天才", Shoe: "鞋子：Nike-AirJordan 1, 16", Another: "簡介：在國中三年追求50個女生都被甩掉。進入高中後對赤木晴子一見鍾情，為吸引她而進入籃球隊。他從籃球的門外漢，在短短的幾個月里成長為天才籃球手。他對感興趣的東西學起來很快，擅長籃板球和灌籃。速度和彈跳力很好，而且有著驚人的充沛體力，常常做出令人意想不到的舉動，從而改變整個球隊的氣氛，令人聯想到丹尼斯·羅得曼。因為赤木晴子暗戀流川楓，所以他非常嫉妒流川楓，兩個人也經常爭吵打架，不過，他們各自心裡還是佩服對方的球技的。"),
    Member(Name: "赤木剛憲", Birthday: "生日：05/10", Number: "球衣號碼：04號", Location: "位置：中鋒", Height_Weight: "身高/體重：197cm / 93kg", Nickname: "綽號：大猩猩", Shoe: "Converse", Another: "簡介：球隊的隊長，也是球隊的支柱。攻防俱佳，是全國一流的中鋒。是縣大賽五位明星球員之一。他從小學開始就夢想稱霸全國，上高中後，雖然自己的球技一流，卻沒有好的隊友，所以夢想一直都無法實現，是個孤獨的男人。終於在高三時，一下子獲得了好的隊友，打入了全國大賽。雖然在全國大賽中沒有打入八強，但擊敗了全國第一的山王，應該也很值得驕傲了。他對夢想的執著追求，實在令人非常欽佩。"),
    Member(Name: "流川楓", Birthday: "生日：01/01", Number: "球衣號碼：11號", Location: "位置：小前鋒", Height_Weight: "身高/體重：187cm / 75kg", Nickname: "綽號：狐狸", Shoe: "Nike-AirJordan 5", Another: "簡介：長得很帥，而且有精湛的球技，所以擁有許多瘋狂的女球迷，不過他從來不理會那些女生的尖叫，心裡只有籃球。因為櫻木嫉妒他，第一次見面他就莫名其妙的被櫻木揍了一頓，以後更是水火不容。他非常地酷，不愛說話，只有跟櫻木吵架才會主動開口，最聽從學姐彩子的話。他除了 籃球，最大的嗜好就是睡覺。不僅上課睡，騎車的時候也睡，櫻木說上帝對流川偏心也不是沒道理，否則他怎麼能活到現在。 雖然打球的時候獨斷獨行，但也經常改變整個比賽的局勢，是縣大賽中五位明星球員之 一。他計劃要去美國，但在安西的勸說下，決定先成為日本第一的高中生。"),
    Member(Name: "三井壽", Birthday: "生日：05/22", Number: "球衣號碼：14號", Location: "位置：得分後衛", Height_Weight: "身高/體重：184cm / 70kg", Nickname: "綽號：小三", Shoe: "Asics", Another: "簡介：長得相當帥氣的小伙子，國中時擁有輝煌的過去，在縣決賽時射入關鍵一球而獲得冠軍，他則獲得了最有價值球員(MVP)的榮譽。他為了保答安西教練而進入湘北，也懷著要使湘北稱霸全國的理想。但是不幸在練習中受傷，看到赤木在球隊中的卓越表現後，覺得自己在隊中沒有價值而離開了籃球隊，成為不良幫派的頭。在一次找籃球隊麻煩時，赤木、木暮和安西教練的教誨終於使他浪子回頭，重新歸隊。他擅長射三分球，但是現在的體力已經不如從前。 不到最後絕不輕易放棄是他的信條。"),
    Member(Name: "宫城良田", Birthday: "生日：07/31", Number: "球衣號碼：07號", Location: "位置：控球後衛", Height_Weight: "身高/體重：168cm / 59kg", Nickname: "綽號：小宮", Shoe: "Converse Accelerator", Another: "簡介：雖然個子矮了點，卻也很酷。 他暗戀彩子，為了她而打籃球。也為了要忘記彩子而和其他女孩交往，被甩了10次，因此和櫻木惺惺相惜，成為知己。他的速度飛快，身手靈活，是縣內一流的後衛，實力直逼阿牧和藤真。他也是超級問題兒童，因為和三井打架住進醫院，後來三井來找他尋仇，球隊險些被廢隊，但也因此召回了明星球員三井，可謂因禍得福。"),
    Member(Name: "木暮公延", Birthday: "生日：07/12", Number: "球衣號碼：05號", Location: "位置：小前鋒", Height_Weight: "身高/體重：178cm / 62kg", Nickname: "綽號：眼睛兄", Shoe: "None", Another: "簡介：副隊長，湘北的第一候補隊員， 三分球投得不錯，是湘北戰勝陵南一戰的功臣。他是球隊的好好先生，在赤木嚴厲的領導下緩和球隊的氣氛，也經常給櫻木鼓勵。 他和赤木被稱為「糖」和「鞭子」。")
]
